Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/0/fluidRegion/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 97.0875;

boundaryField
{
    "innerPropellantOutlet.*"
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.004962;
        value           $internalField;
    }
    "outerPropellantInlet.*"
    {
        type            zeroGradient;
    }
    ".*Inlet|.*Outlet|outerPropellantOR.*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    ".*Right|.*Left"
    {
        type            symmetry;
    }
}

// ************************************************************************* //
