Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/0/fluidRegion/k
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2.048341 ;

boundaryField
{
    "outerPropellantInlet.*"
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.023371;
        value           $internalField;
    }
    "innerPropellantOutlet.*"
    {
        type            zeroGradient;
    }
    ".*Inlet|.*Outlet|outerPropellantOR.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    ".*Right|.*Left"
    {
        type            symmetry;
    }
}

// ************************************************************************* //
