Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/0/fluidRegion/powerDensityNeutronics.serpent
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.1/fluidRegion";
    object      powerDensityNeutronics;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
81900
(
1.73223e+08
1.54405e+08
1.85224e+08
2.15212e+08
2.29122e+08
2.34537e+08
1.69723e+08
2.01315e+08
...
)
;

boundaryField
{
    o5Right
    {
        type            symmetry;
    }
    o4Right
    {
        type            symmetry;
    }
    innerPropellantRight
    {
        type            symmetry;
    }
    hotFritRight
    {
        type            symmetry;
    }
    o3Right
    {
        type            symmetry;
    }
    outerPropellantRight
    {
        type            symmetry;
    }
    fuelRight
    {
        type            symmetry;
    }
    o2Right
    {
        type            symmetry;
    }
    o1Right
    {
        type            symmetry;
    }
    o5Left
    {
        type            symmetry;
    }
    o4Left
    {
        type            symmetry;
    }
    innerPropellantLeft
    {
        type            symmetry;
    }
    hotFritLeft
    {
        type            symmetry;
    }
    o3Left
    {
        type            symmetry;
    }
    outerPropellantLeft
    {
        type            symmetry;
    }
    fuelLeft
    {
        type            symmetry;
    }
    o2Left
    {
        type            symmetry;
    }
    o1Left
    {
        type            symmetry;
    }
    innerPropellantOutlet15
    {
        type            zeroGradient;
    }
    hotFritOutlet
    {
        type            zeroGradient;
    }
    fuelOutlet
    {
        type            zeroGradient;
    }
    coldFritOutlet
    {
        type            zeroGradient;
    }
    outerPropellantOutlet
    {
        type            zeroGradient;
    }
    innerPropellantInlet
    {
        type            zeroGradient;
    }
    hotFritInlet
    {
        type            zeroGradient;
    }
    fuelInlet
    {
        type            zeroGradient;
    }
    coldFritInlet
    {
        type            zeroGradient;
    }
    outerPropellantInlet15
    {
        type            zeroGradient;
    }
    outerPropellantOR15
    {
        type            zeroGradient;
    }
    innerPropellantOutlet16
    {
        type            zeroGradient;
    }
    outerPropellantInlet16
    {
        type            zeroGradient;
    }
    outerPropellantOR16
    {
        type            zeroGradient;
    }
    innerPropellantOutlet17
    {
        type            zeroGradient;
    }
    outerPropellantInlet17
    {
        type            zeroGradient;
    }
    outerPropellantOR17
    {
        type            zeroGradient;
    }
    innerPropellantOutlet18
    {
        type            zeroGradient;
    }
    outerPropellantInlet18
    {
        type            zeroGradient;
    }
    outerPropellantOR18
    {
        type            zeroGradient;
    }
    innerPropellantOutlet22
    {
        type            zeroGradient;
    }
    outerPropellantOR22
    {
        type            zeroGradient;
    }
    outerPropellantInlet22
    {
        type            zeroGradient;
    }
    innerPropellantOutlet23
    {
        type            zeroGradient;
    }
    outerPropellantInlet23
    {
        type            zeroGradient;
    }
    outerPropellantOR23
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
