Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/0/thermoMechanicalRegion/Q
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/thermoMechanicalRegion";
    object      powerDensityNeutronics;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
41588
(
2.329020e+08
1.655520e+08
1.233050e+08
3.203450e+07
1.205090e+08
4.766190e+07
2.149460e+08
2.198780e+08
...
)
;

boundaryField
{
    o5Right
    {
        type            zeroGradient;
    }
    o4Right
    {
        type            zeroGradient;
    }
    innerPropellantRight
    {
        type            zeroGradient;
    }
    hotFritRight
    {
        type            zeroGradient;
    }
    o3Right
    {
        type            zeroGradient;
    }
    outerPropellantRight
    {
        type            zeroGradient;
    }
    fuelRight
    {
        type            zeroGradient;
    }
    o2Right
    {
        type            zeroGradient;
    }
    o1Right
    {
        type            zeroGradient;
    }
    o5Left
    {
        type            zeroGradient;
    }
    o4Left
    {
        type            zeroGradient;
    }
    innerPropellantLeft
    {
        type            zeroGradient;
    }
    hotFritLeft
    {
        type            zeroGradient;
    }
    o3Left
    {
        type            zeroGradient;
    }
    outerPropellantLeft
    {
        type            zeroGradient;
    }
    fuelLeft
    {
        type            zeroGradient;
    }
    o2Left
    {
        type            zeroGradient;
    }
    o1Left
    {
        type            zeroGradient;
    }
    innerPropellantOutlet15
    {
        type            zeroGradient;
    }
    hotFritOutlet
    {
        type            zeroGradient;
    }
    fuelOutlet
    {
        type            zeroGradient;
    }
    coldFritOutlet
    {
        type            zeroGradient;
    }
    outerPropellantOutlet
    {
        type            zeroGradient;
    }
    innerPropellantInlet
    {
        type            zeroGradient;
    }
    hotFritInlet
    {
        type            zeroGradient;
    }
    fuelInlet
    {
        type            zeroGradient;
    }
    coldFritInlet
    {
        type            zeroGradient;
    }
    outerPropellantInlet15
    {
        type            zeroGradient;
    }
    outerPropellantOR15
    {
        type            zeroGradient;
    }
    innerPropellantOutlet16
    {
        type            zeroGradient;
    }
    outerPropellantInlet16
    {
        type            zeroGradient;
    }
    outerPropellantOR16
    {
        type            zeroGradient;
    }
    innerPropellantOutlet17
    {
        type            zeroGradient;
    }
    outerPropellantInlet17
    {
        type            zeroGradient;
    }
    outerPropellantOR17
    {
        type            zeroGradient;
    }
    innerPropellantOutlet18
    {
        type            zeroGradient;
    }
    outerPropellantInlet18
    {
        type            zeroGradient;
    }
    outerPropellantOR18
    {
        type            zeroGradient;
    }
    innerPropellantOutlet22
    {
        type            zeroGradient;
    }
    outerPropellantOR22
    {
        type            zeroGradient;
    }
    outerPropellantInlet22
    {
        type            zeroGradient;
    }
    innerPropellantOutlet23
    {
        type            zeroGradient;
    }
    outerPropellantInlet23
    {
        type            zeroGradient;
    }
    outerPropellantOR23
    {
        type            zeroGradient;
    }
    outside
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    ifc18
    {
        type            zeroGradient;
    }
    ifc23
    {
        type            zeroGradient;
    }
    ifc22
    {
        type            zeroGradient;
    }
    ifc17
    {
        type            zeroGradient;
    }
    ifc16
    {
        type            zeroGradient;
    }
    ifc15
    {
        type            zeroGradient;
    }
    zeroGrad
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
