Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/0/thermoMechanicalRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField           uniform 200;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
    ifc15
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            "T";
        kappaLayers     (1);
        kappaMethod     lookup;
        kappa           "k";
        value           $internalField;
    }
    ifc16
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            "T";
        kappaLayers     (1);
        kappaMethod     lookup;
        kappa           "k";
        value           $internalField;
    }    
    ifc17
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            "T";
        kappaLayers     (1);
        kappaMethod     lookup;
        kappa           "k";
        value           $internalField;
    }    
    ifc18
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            "T";
        kappaLayers     (1);
        kappaMethod     lookup;
        kappa           "k";
        value           $internalField;
    }    
    ifc22
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            "T";
        kappaLayers     (1);
        kappaMethod     lookup;
        kappa           "k";
        value           $internalField;
    }    
    ifc23
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            "T";
        kappaLayers     (1);
        kappaMethod     lookup;
        kappa           "k";
        value           $internalField;
    }    
}

// ************************************************************************* //
