Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/constant/fluidRegion/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluidRegion";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;    // General thermophysical model calculation
                                    // based on enthalpy h or internal energy e,
                                    // and density rho
    mixture         pureMixture;
    properties      liquid;
    energy          sensibleEnthalpy;
}
mixture
{
    H2;
}

// ************************************************************************* //
