Tutorials/reactorCases/3D_genericParticleBedNTP/rootCase/system/thermoMechanicalRegion/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
        minIter         1;
        maxIter         100;
    }
}

stressAnalysis
{
    compactNormalStress yes;
    nCorrectors         3;
    maxOuterIter        1000;
    relT                1e-6;
    T                   1e-6;
}

relaxationFactors
{
    fields
    {
	    D            0.99;
    }
}

// ************************************************************************* //
